{
    "intents":[
        {
            "tag": "saludo",
            "patterns":["hola","Hola","buenos días","buenas tardes","buenas noches","como estás","ayudame con","saludos","ola","holi","hello"],
            "responses": ["Bienvenido! Como puedo ayudarte","Hola, como puedo ayudarte?","Será un gusto ayudarte con la información que necesites"]
        },
        {
            "tag": "nombre",
            "patterns": ["como te llamas","cual es tu nombre"],
            "responses":["Hola, mi nombre es EduBotEc"]
        },
        {
            "tag":"despedida",
            "patterns":["adios","hasta luego","hasta pronto"],
            "responses":["Espero verte pronto para aprender más sobre historia"]
        },
        {
            "tag":"agradeciiento",
            "patterns":["gracias","muchas gracias","te lo agradezco","agradecido"],
            "responses":["Estoy aqui para ayudarte","Es un gusto, poder ayudarte"]
        },
        {
            "tag":"simon_bolivar",
            "patterns":["quién fue simon bolivar", "háblame de simon bolivar", "simon bolivar historia"],
            "responses":["Simón Bolívar, conocido como 'El Libertador', fue un líder militar y político que jugó un papel fundamental en la independencia de varios países de América del Sur, incluido Ecuador.",
        "Bolívar lideró campañas que liberaron a Venezuela, Colombia, Ecuador, Perú y Bolivia del dominio español. Su visión era la unión de los países latinoamericanos bajo una gran nación."]
        },
        {
            "tag":"antonio_jose_de_sucre",
            "patterns":["quién fue antonio jose de sucre", "háblame de antonio jose de sucre", "Antonio jose de sucre historia"],
            "responses":["Antonio José de Sucre fue un militar y líder independentista que desempeñó un papel clave en la independencia de Ecuador, Perú y Bolivia. Fue el gran estratega de la Batalla de Pichincha en 1822.",
        "Sucre fue un colaborador cercano de Simón Bolívar y se convirtió en el primer presidente de Bolivia. Es recordado por su valentía y su capacidad como estratega militar."]
        },
        {
            "tag":"eugenio_espejo",
            "patterns":["quién fue Eugenio Espejo", "háblame de Eugenio Espejo", "Eugenio Espejo historia"],
            "responses":["Eugenio Espejo fue un médico, escritor y pensador ecuatoriano del siglo XVIII. Es considerado precursor de la independencia por sus ideas revolucionarias.",
        "Espejo promovió la educación y la libertad de pensamiento en Quito. Fundó el periódico 'Primicias de la Cultura de Quito'."]
        },
        {
            "tag":"manuelita_saenz",
            "patterns":["quién fue Manuelita Saenz", "háblame de Manuelita Saenz", "Manuelita Saenz historia"],
            "responses":["Manuela Sáenz fue una patriota ecuatoriana y una de las figuras más destacadas de la independencia sudamericana. Fue una aliada clave de Simón Bolívar, a quien salvó de un atentado en 1828.",
        "Se le conoce como 'La Libertadora del Libertador' por su papel en la lucha independentista. Además de su relación con Bolívar, participó activamente en las campañas militares y políticas."]
        }
    ]
}